{"podcast_details": {"podcast_title": "The Intelligence from The Economist", "episode_title": "Vote with no confidence: Zimbabwe goes to the polls", "episode_image": "https://assets.pippa.io/shows/62e286a934d4d93d6587424a/1689776476419-b4e4678d8a2f9264c3a6b3be36f4eb79.jpeg", "episode_transcript": " Hello and welcome to The Intelligence from The Economist. I'm your host, Jason Palmer. Every weekday we provide a fresh perspective on the events shaping your world. In Lahaina, on Hawaii's island of Maui, people are only just starting to count the costs of this month's devastating fires. Our correspondent visits and finds people wrestling with three emotions – shock, devastation and anger. And in Britain we chart the rise of a curious species – the self-pitying Member of Parliament. The pay is bad, the hours long, bootlicking chumps rise through the ranks. Cheer up, our columnist says, there is simply no finer, more consequential job. Stop though. The polls are open in Zimbabwe this morning, and as the country has geared up for a general election, incumbent President Emerson Mnangagwa and his Zanupieff party have been busy. Zanupieff is ready to yet again receive the full endorsement and mandate of the people of Zimbabwe. The campaign trail has been packed with mass rallies, thousands of people seemingly willing to lend their voices to the government's cause. Or maybe not. Locals in Harare, Zimbabwe's capital, have complained of being forced to attend. Nearby, market traders risked losing their licenses if they didn't, and state-owned buses were used to bring voters in from hundreds of miles away. For many of Zimbabwe's voters, today will be little more than a democratic charade, orchestrated by a ruling party whose allegiances are shifting away from the West. Polls have already opened in Zimbabwe for the general election, and the mood is fairly despondent. John McDermott is the Economist's Chief Africa Correspondent. That's because while most Zimbabweans feel the country is going in the wrong direction, journalists still expect Emerson Mnangagwa, the 80-year-old president, to win re-election because his ruling party, ZANOPF, is tilting the playing field once again in an unfair direction. And you say that people are unhappy with the direction of the country. What is that direction? How are things? That's right. Afrobarometer, a Pan-African research organization, found recently that 72% of Zimbabweans think the country is going in the wrong direction, and that's up 10 percentage points from the last election in 2018. And that makes sense to me because whenever I go to Zimbabwe, it's almost like opening up a time capsule that hasn't been touched for 40 years. There's none of the development that you might see in Nairobi, Kenya's capital, or Addis Ababa in Ethiopia. It feels stagnant. And that's ultimately because it is stagnant. Listeners may be familiar with the idea of the $100 trillion bill from the time of Robert McGabe, who Mr. Minnengago replaced in 2017 in a coup. It's not as blatant these days, but ultimately the state is still printing money. And that inevitably causes devaluation of the local currency. It also fuels inflation. We're not at the trillion percent of a decade of surgo, but the most recent figures suggest that annualized inflation is still in the triple digits. And this just means more misery for ordinary Zimbabrians who've had their pensions or savings wiped out. It's not just mismanagement of the economy. In the past year especially, there have been some credible allegations of corruption going right to the top of the Zimbabwean government. And you say that in addition to all of that mismanagement and potential dodgy dealings, ZNOPF is tilting the playing field as regards to the election. That's when listeners think of attempts to manipulate election results. They think of somebody stuffing ballots or changing the tallies at polling stations. But actually the most impactful ways to tilt the playing field happen long before election day. A lot of the things that the ruling party appears to be doing are familiar from previous elections. So there is the misuse of state resources, handing out inducements to influential local elites, handing out agricultural inputs in rural areas. There's the mobilizing of the law to clamp down on dissent. And then there is what looks like chicanery related to the vote itself. The opposition parties are worried that they still don't have a full list of the polling stations even now, which might give the opportunity to, let's just say, augment the final voting tallies. But on top of those slightly kind of old fashioned ways, there's a new tool in town. And that's a shadowy organization called Forever Associates Zimbabwe, which its leaders claim is a door to door grassroots organization founded by patriots because of an organic ground swell of enthusiasm for the octogenarian president. But local think tanks and pro-democracy activists suggest it's in fact a front for the domestic spy agency used to intimidate voters. And so who is the opposition that's fighting this uphill battle? The main opposition leader is a 45 year old lawyer and lay preacher called Nelson Chimesa. I went to visit him just as campaigning was getting underway for his party, the Citizens Coalition for Change. And it wasn't like meeting most politicians. We didn't go to the party headquarters, we went to an office building in downtown Harare where we took a very creaky elevator up to the top floor and where we were greeted in essentially an empty office space with flickering fluorescent lights and paint peeling off the walls. But that was the location that Mr. Chimesa felt was most apt for meeting at the time given his predicament. These are my advocates chambers offices. So that's where lawyers are, it's mainly advocates. So we have about 12 of us here. So it's a safer space for your purposes. Very important. And can I, sorry, can I just ask why it is important to have a safer space? Why have you brought us here rather than to your party? Well you see, there's always a problem with the spokes and the intelligence, they you know, they just want to know whom we have met and why and you know, it's just not a proper environment. And that's wrong. And he reminded me when I was there that it's often been unsafe for opposition leaders in the country under ZANOPF. So you've had three MPs in prison over the past year or and Job is still in prison? No, it's even more. There's Joanna Mamombe. Some lady was also arrested, she's an MP for demonstrating and they were abducted together Cecilia Zimbiri. This was like a year ago. So if we look at the numbers, it's even much more than that. There's Tofa from Ulawai, the much south, who was also beaten up and broke her arm. Those are primitive stories. But it tells you the kind of environment that we are in, authoritarianism, tyranny, despotism. Mr. Chimisa is a pretty good campaigner. He appeals not just to young urban Zimbabrians, but also to those in the rural areas where ZANOPF has traditionally been strong. However, nobody really knows what he would be like in the unlikely event that he became president. As the party says, it wants to stop corruption and fix the economy. But regardless, most analysts think that a Chimisa presidency is something that isn't going to happen in any case. Well, it does sound as if ZANOPF has things absolutely tied up inside the country. Is there nothing that outside pressure might be able to do to level that playing field? The West has sporadically tried to offer Zimbabwe a path back to normalcy. For more than two decades, it's been something of a pariah state. It's locked out of international capital markets. And it remains largely in default on around $18 billion worth of external debts. So what the West at various times has said is if you stop messing around with the economy and you start introducing some political reforms, ensure the rule of law, then we can talk about bringing you back into the international financial fault. However, that has never really happened. There hasn't been a long enough period of sustained political improvement. And all the while, that has meant that ZANOPF has come to lean more and more on autocratic partners such as Belarus, Russia, and China. Having said all that, the international picture, the broad international picture is actually less important than the regional one. And the key country in all of this is neighboring South Africa, where perhaps millions of Zimbabwe's have emigrated to because of the economic situation. Sadly, in South Africa, the ruling African National Congress has largely whitewashed abuses and chicanery by its fellow liberation party, ZANOPF. This time around, there is some hope that Zambia, Zimbabwe's neighbor to the north, will apply a bit more pressure. But ultimately, the fear is that once again, election observers from around the world will see a largely peaceful and orderly vote and conflate it with a fair one. John, thanks very much for your time. Thank you, Jason. President Joe Biden visited Maui this week to see the devastation wrought by the deadliest wildfire America has seen in more than a century. I want you to know the entire country is here for you. That's not hyperbole. We mean that. He arrived on the Hawaiian island almost two weeks after the fire destroyed the town of Lahaina. At least 114 people are known to have died and hundreds and hundreds more, including many children, are still missing. Locals are still asking if more could have been done to prevent the tragedy and to help survivors. So I just got to Lahaina. Erin Braun is our West Coast correspondent. She's been on Maui for the past week covering the aftermath of the fires there. I can see a neighborhood that had burned. Only shells of houses are left. It almost looks like the place was bombed. There's ash everywhere. And the palm trees all along the road I'm walking down are dead. It's just horrific. This is the worst thing I've ever seen. So Erin, you're back at home now. Can you take us through what you saw, who you met? We know that there was very little warning for this and we've heard a lot about the devastation. Now that the shock has worn off it at least a bit, how are people feeling? In talking to Lahaina residents, it seemed like there were three prevailing emotions. The first was still shock, even a week after the fire when I was on the ground there. They told me they weren't ready to process what had happened to them yet. Others were obviously devastated and they had moved into the mourning phase. But I also met a lot of people who were angry. We were helpless. We had no idea. There was no alerts. There was no warning. This is Lillianoy. She and her partner Demetrius were both born and raised in Lahaina. They were driving through the town together as the fire was spreading. And there was no such thing as evacuation sirens. Yeah, there could have been a lot more done to save our people and our community, even like some buildings. They felt abandoned by their local officials who had failed to warn them of the danger. Many in Lahaina were obviously not lucky enough to escape the flames. And are we any clearer now about why it is that the people of Lahaina weren't properly warned? In theory, Hawaii has this really robust outdoor siren system that the island says is world beating. But these sirens were not used to warn Lahaina residents that their town was burning and that they needed to evacuate. And last week, Maui's emergency management chief defended the decision and his argument was that if residents would have heard the sirens, they would have moved to higher ground as they're trained to do during a tsunami. And they would have ended up right in the middle of the flames. Since making that statement, the emergency management chief has actually resigned his post and the state's attorney general has asked for an independent investigator to look into the way that the state and Maui County responded to the fire. We might not know the results of that investigation for a while, but in the meantime, Lahaina residents are left to sort through the wreckage of their community and wonder if parts of it could have been saved. And what do those recovery efforts look like at this point? America's Federal Emergency Management Agency, which is known as FEMA, has sent a bunch of search teams and cadaver dogs to sift through what is left of the town. Unfortunately, at this point, it's not a search and rescue. They're just searching for bodies. I spoke to one member of FEMA's urban search and rescue division, Stephen Bajoon, and he talked me through what the teams are doing and how exactly they go about searching through the ruins. So what we've got is two task forces currently in the field and then about 20 search and rescue canines. Okay. There's another 20 search and rescue canines are actually landing as we speak. So we'll have 40 different dogs out there working. I asked him what exactly search teams look for when they're trying to find human remains. So what we look for is those obvious spots, a bed, a corner of a room, places that people would typically hide. But the biggest tool and the biggest resource that we have is our canines. The ability to pick up on just the faintest scent, a part familiar. The typical team brings four dogs. We have 40 dogs out working. That's how important this is. And that's why there's so many more dogs that we would normally have engaged in this. I saw the cadaver dogs. They were wearing these little booties to protect their feet since the ground was still quite hot and there was broken glass and rubble everywhere. But FEMA told me that the complete and utter devastation of the town over such a large area made this search unlike any the team had done before. What's so unique and so different about this is the totality of it. It's not a hurricane where it pushed some things over. It's not wind from a tornado. What we're dealing with here is there isn't a structure left. There are still hundreds of people missing from Lyna. And because of the scale of the devastation, it could take weeks or even months to get a full understanding of who was lost. And President Joe Biden has now at last visited Maui. How was he received there? The Biden administration says there are more than a thousand federal personnel on the island helping with disaster response. But the response to federal aid has been mixed. I spoke to people who were pretty grateful for the help, but others were much more critical and wondered, A, why it took the president so long to comment on the fire after it happened. Some people brought up a video of him on the beach in Delaware declining to comment on the situation and B, to get himself to Maui. His visit is almost two weeks after the fire. And I suppose a visit from a president is a bit of psychological support, but the people of Lahaina need a lot more than that, right? Yeah. There's a huge amount of worry on the island about where the 13,000 people who lived in Lahaina before the fire will live. There were temporary shelters that cropped up after the fire and have since been mostly closed down because FEMA is housing people in hotel rooms. But even those hotel rooms are a very temporary solution and locals know it, so they're really worried. Making things much trickier is Hawaii's housing shortage. The state's median listing price for a home is nearly twice what the nation's is. And now you've got thousand more Hawaiians who are going to be searching for a home. So the worry is that some of them might not find one and there's evidence for that happening. If you think about the campfire that incinerated the town of Paradise in California in 2018, homelessness spiked in the region in the years following that fire. And so residents, they know it's going to be a long time before it's possible to get into permanent homes. But many of them are already looking forward to rebuilding what they lost. We're going to rebuild and it won't be the same, but Lahaina is going to come back stronger than ever. I mean, it's not going to happen overnight, but it's going to happen. Erin, thanks very much for joining us. Thanks Jason. Britain's House of Commons is designed to create conflict, not consensus. Duncan Robinson is The Economist's political editor and writes Badgett, our column on British politics. Spare us the theatrics. Behave yourself. Be a good boy, young man. Coalitions are rare, governments govern and oppositions oppose. And parliamentarians sit facing each other in the chamber, supposedly two sword lengths apart and heckle each other with gusto. Mr Speaker, the Honourable Gentleman has been on the wrong side of this issue his entire career. He described all immigration law as racist. It is clear, Mr Speaker, while he's in hock to the open border activists, we're on the side of the British people. Yet practically all MPs agree on one thing, that being an MP is terrible. Speak to a parliamentarian for longer than a few minutes and the complaints will come fast. It's only sucking up that gets you ahead. The constituency work is tedious and draining. The pay is woeful. People are so mean on Twitter. Somehow, the most powerful people in the country are now the most self-pitying. And what is more, pundits agree. As the Sunday Times put it, all out, why nobody wants to be an MP anymore. Meanwhile, Rory Stewart, a former MP and now a podcaster, said being a legislator was, quote, bad for my brain, my body, my soul. It's a miserable picture. Thankfully, it's an inaccurate one. Take the complaints among MPs that incompetent boot lickers rise faster than their more talented and more principled peers. It's completely overdone. Parliament is mostly meritocratic. Those who are skilled rise quickly. Rishi Sunak became Chancellor five years after entering parliament. Zakir Starmer became party leader in the same stretch of time. Just because a few duds saw her reach the top. Mr Speaker, I am a fighter and not a quitter. Does not mean that parliament is stuffed with unused talent. This is tough to accept for anyone still on the back benches who gripe to journalists about it. Luckily, they have the time to do it. Working in a literal palace by the Thames does peculiar things to one's perspective. For example, pay, which is probably the biggest complaint malcontent members like to gripe about. They're hardly hard done by. At £87,000, or $113,000, it's around double the London average. Indeed, it's only low when compared with industries where salaries have exploded, such as finance and law. Increasing salaries in Westminster may widen the talent pool, but it would not solve the fundamental problem that the typical MP probably earns less than their best mate who went into the private sector. Being a backbencher might not be glamorous, but it certainly isn't the most demanding job. Telling an MP about to spend another weekend litter picking in their constituency that their hours could be worse would win few friends. It is, however, true. Parliament no longer regularly sits into the early morning. Recess, which kicked off for a six week summer break in July, is not technically a holiday. But many MPs do depart for sunny yellow carls, and most parliamentary assistants will hear virtually nothing from their blotters, bar the odd call with the sound of the Mediterranean in the background. Plus, there are a few professions which allow people the time to write books, practice law, and present television shows on the side. Managing that as a headteacher or truck driver, or just about any other job, would be tricky. Granted, one thing has become worse for MPs through no fault of their own. Abuse of politicians online is rife. Green ink letters at least took effort. Now nutters can send an insult at 1.13am on Twitter, and there's a good chance it'll be read by an MP doom-scrolling in bed. But by and large, MPs have it good, and few people are willing to offer them a reality check. Pitying the most powerful people in the country is common among journalists in Westminster. Who's in, Prime Minister? Planning big changes? During v-shuffles, hacks sympathise with the ministers and their aides who have lost their jobs. Bad news for some, summoned to the PM's Parliamentary Office, leave in without a job. Education Secretary Gavin Williamson failed to make the grade. The fact that ministers can lose their livelihood quickly is a feature, not a bug. Moaning about it is akin to complaining about democracy, and a call for a world in which human resources trumps politics. Finally, for a supposedly terrible job, plenty of people still want to do it. Hordes of ambitious 30-something Labour activists are gouging each other for seats ahead of the next election. The Conservatives may be set for a hiding, yet each available seat has triggered a heated battle among wannabe Tory MPs. The complaints come from those who expect things will just be handed to them. For example, a certain type of prospective politician expects to flounce into government without muddying their hands in campaigning or enduring a stint in opposition. But opposition is an opportunity. The Conservatives who ran the country from 2010 were those who signed up for duty in the 1997 and 2001 elections when the party received drubbings. There is no pain without some gain. Complaining about life as an MP is the apogée of Britain's shift from democracy to winchocracy. Others sit atop the most unconstrained executive in the democratic world and complain about the Blob, a cabal of civil servants and judges who supposedly thwart their will. Literal lawmakers claim they are powerless to change Britain. All jobs have some drawbacks, but few come with the opportunity to wield power. Shaping a G7 country beats collecting a fat salary in the city. And Britain has a centralised and responsive state. A good decision in Westminster can change the lives of millions for the better. Running a country is a privilege, not just a burden. The Honourable Gentleman has got to learn the art of patience. And if he is patient, if he deploys Zen, he will find that it is ultimately to everybody's advantage. Cheer up Westminster. There is no finer job. The world is unpredictable, but it's also understandable. The World Education offers a six-week online course on international relations. Designed by The Economist's editors and invited experts, it gives you the knowledge and insight to navigate the rapidly changing worlds of geopolitics, business and technology. And as a listener, enjoy a 15% discount with the code POLITICS. Also sign up now at Economist.com forward slash international relations."}, "podcast_summary": "Fires devastate Lahaina, hearts broken as lives are lost. Zimbabwe's elections rigged once again. Is being an MP really that terrible? The British parliament in focus.", "podcast_guest": "John McDermott", "podcast_highlights": "Highlight 1: \"Today will be little more than a democratic charade, orchestrated by a ruling party whose allegiances are shifting away from the West.\" - The general election in Zimbabwe is marred by allegations of forced attendance and manipulation, raising concerns about its democratic integrity.\n\nHighlight 2: \"They felt abandoned by their local officials who had failed to warn them of the danger.\" - The devastating wildfires in Lahaina, Hawaii, led to a sense of shock and anger among residents who felt they were not properly warned and left to deal with the aftermath on their own."}