{"podcast_details": {"podcast_title": "Health Check", "episode_title": "Contaminated cough syrup found in Iraq", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p05zf4rh.jpg", "episode_transcript": " Hello and welcome to this podcast from the BBC World Service. Please let us know what you think and tell other people about us on social media. Podcasts from the BBC World Service are supported by advertising. Hey, I'm Ryan Reynolds. At MinMobil, we like to do the opposite of what Big Wireless does. They charge you a lot, we charge you a little. So naturally, when they announced they'd be raising their prices due to inflation, we decided to deflate our prices due to not hating you. That's right, we're cutting the price of Mint Unlimited from $30 a month to just $15 a month. Give it a try at MintMobil.com slash switch. New activation and upfront payment for three-month plan required, taxes and fees extra. Additional restrictions apply. See MintMobil.com for full terms. Well, well, well. Shopping for a car? Yep. Carvana made financing a car as smooth as can be. Oh yeah? It was pre-qualified instantly and had real terms personalized just for me. Doesn't get much smoother than that. Well, I got to browse thousands of car options on Carvana, all within my budget. Doesn't get much smoother than that. It does. I actually wanted a car that seemed out of my range, but I was able to add a co-signer and found my dream car. It doesn't get much- Oh, it gets smoother. It's getting delivered tomorrow. Visit Carvana.com or download the app to get pre-qualified today. Hello and welcome to Health Check from the BBC World Service. I'm Claudia Hammond here with the latest health news from across the globe. And with me this week is the BBC health reporter, Philippa Roxby. Welcome back. What do you have for us later on? Thank you. Well, we're going to be talking about mosquito bed nets and how they can be made even more effective and also nose picking. Who does it? Oh dear, dear. There is proper research about this, I must add. Proper research. And we'll hear from an HIV clinic in Kampala where some people with HIV are afraid to come and collect their medication after the passing of Uganda's Anti-Homosexuality Act. But we are starting with contaminated cough medicines. The World Health Organization has issued an alert about a batch of cough syrup being sold in Iraq. And this is just the latest in a string of health alerts issued in the past 12 months. Now, Philippa, there is a long history of people trying to sell medicines which are either fake or substandard, isn't there? And I can remember us talking on Health Check about this more than a decade ago. Yeah, it's been happening for a while. It's a very difficult issue to solve. How do you check that medicines contain what they're really supposed to contain? How do you regulate that process? How do you know, how do individual companies know what they're buying? And how do people know they're getting what they're actually want to get when they're buying the cough syrups? Now, yeah, now it seems to be cough medicines, cough syrups in particular that are causing a problem. Why them? What is it about them? Well, the way cough syrups are made is interesting. It's paracetamol usually mixed with a syrup. And in the making of that syrup, sometimes you can get byproducts which are quite dangerous and there can be toxins involved. And when that process is really well organized and really, really well refined, those toxins disappear. But unfortunately, in some cough syrups, they've discovered some very, very harmful toxic substances in very small amounts. And they seem to be linked to the deaths of very young children who took them. And there are things that are contained in antifreeze, they're contained in carb break fluid, they're poisons and they just shouldn't be there. And so where have these contaminated syrups been found? They've been found in a whole host of countries now. It started last year in Gambia when authorities started investigating the deaths of about 20 young children there when they developed kidney failure. And then other, it snowballed from there to places like Uzbekistan, Indonesia, Cameroon and laterally the WHO, the World Health Organization have been warning that the threat may encompass other countries too like Cambodia, Philippines, Senegal. So it's a real threat and it's a real worry and the WHO have been making numerous warnings. And there are various court cases taking place now or coming up and some of these medicines come from India, but not all of them. No, some have been linked to manufacturing in India, but not all. But a trial interestingly is starting in Uzbekistan now over the deaths of 65 children. It was 20 children we were told but that number has gone up. And the families of 20 Gambian children who died are also taking their government to court over allegedly mishandling drug imports. So there's lots of legal action taking place. And I can't imagine what it's like for these families when they were trying to care for their sick baby. Yeah, heartbreaking, some really heartbreaking stories and Reuters have done some amazing investigative work into the stories of some of these families whose children were very young, some of them just two or three years old, had a slight fever or a cough. They went to their pharmacist. The pharmacist gave them a cough syrup. There are plenty on the shelves. They took it home. But within days their child changed, stopped eating, stopped urinating. And before they knew it, they were in hospital extremely ill. And doctors said they'd never seen anything like it. And they couldn't save many of these children. And of course, whenever medication is counterfeit or substandard, in a way, it's not only what's in it that's the problem, but what's not in it. I mean, they're missing out on what it is supposed to do. Yes, that's the problem. It really damages the confidence in medicines because not only are they potentially poisoning these children, they didn't do what they intended to do. And these children had very mild, probably mild coughs and mild fevers that should have been really easy to resolve or might well have gone away on their own. And the WHO actually doesn't necessarily recommend cough syrups because it says there's very little evidence of whether they're effective or not. And that's the really sad thing about this whole tale. So what can be done about it because there are cough syrups everywhere and some of them are fine. People tend to have cough syrups in their cupboards somewhere right across the world. And it's very hard to get rid of them. But the World Health Organization are actually going to people's homes. They're going house by house. And some of these countries, they're potentially affected and asking people to give them a cough syrup so they can chuck them away. They're telling them to just hand them over. And they're also trying to encourage countries to improve their regulation, improve their testing, try and companies too to work out exactly where the ingredients for their cough syrups are coming from. Check, double check. Some of these things are really hard though when funding isn't available in some of these poorer places. It's very, very difficult. And I guess it's also very difficult for families once a child has become ill, if people are living where there isn't a lot of medical care nearby, to then get the emergency help that you then need at that point. Yeah, absolutely. Imagine what it's like when you realize your child is failing in front of your eyes and you know that the nearest big hospital is perhaps across the border or hundreds of miles away. And how do you get there? And how are you going to finance that? What are you going to do? Yeah, very, very difficult situation. Thank you very much for that, Philippa. And do stay with us. Now, you may remember that back in May, Uganda passed the Anti-Homosexuality Act. And on Health Check, we discussed the impact that it was feared the act might have on health care, especially for people living with HIV. Now, the country has made huge progress against HIV over the past three decades through education and testing and treatment. But with some of the strictest legislation in the world, activists were afraid of what might happen next. So three months on from the new act being passed, for Health Check, our reporter Gronja Harrington reports from Kampala. This country will stand firm. We are going to reinforce the law enforcement officers to make sure that homosexuals have no space in Uganda. Jubilation in the Ugandan parliament as lawmakers pass the Anti-Homosexuality Act, or the AHA as it's known here. Out of almost 350 MPs, only one voted against the legislation. The law is vague and far reaching. And so the space for LGBTQ people has indeed become very small. And this has consequences for their health care. Richard Lusimbo is the founder of the Uganda Key Populations Consortium, which lobbies for health services for marginalised communities. We've seen cases of stigma and discrimination across the spectrum. People being thrown from homes, people being denied shelter by their own families, people being attacked on the streets. But we have also seen people being denied services in a health facility. People with stigma and discrimination now feel like, yeah, now they have a right not to treat the LGBT community members. Members of all faiths lobbied hard for the passing of the AHA. Not far from this church is Uganda's first ever specialised clinic for LGBTQ people, Icebreakers, which opened in 2012. Normally 20 or 30 patients would come here on any given day. Now they see a maximum of three patients a day. The new law obliges anyone who suspects somebody of being LGBTQ to report them to the police. But promoting or normalising homosexuality is punishable by a jail term of up to 20 years. That means just coming into a place like this or working here has become very risky. The programme's manager gives me a tour. So when people are diagnosed, they come down here, the dispensing person is in here to actually give them the medicine they need. But there's no dispensary today? No, they were here in the morning and didn't leave, because now we do appointments so that can keep our clients safe. Some of them are even scared of coming in here. And have you noticed differences in the stocks of drugs? Are you using them at a slower rate, for example? Yeah, yeah. The uptick has actually reduced. We are afraid of what might happen where the clients who need these drugs cannot access them in time, especially with antiviral drugs. Those ones are key because they need to be taken at certain times and all the time. Most other staff now work from home as much as possible. They're afraid to come here since the law passed. This doctor is the only exception today. He says that apart from the fear of coming here, his patients now face all kinds of other obstacles to getting the services they need. Many of our clients have called in to tell us that they have been terminated from their jobs. And so those ones who are sustaining a life on ARRVs are actually getting difficult in having nutritional care. They need good nutrition. They will start experiencing side effects. For example, someone takes the drugs and they start feeling lightheadedness because the liver is overworking. You start feeling you can't take it anymore. And that is what is happening now in this period. Health workers say a drop in adherence to antiretroviral therapy is a huge concern. The disease is easier to transmit when the viral load isn't suppressed. After the AHA was passed, the health ministry belatedly released a circular saying medical staff shouldn't discriminate against LGBTQ people. But the reality is that discrimination is now enshrined in law. Even offering services to the community could be illegal. It's not just a concern for local organisations. PEPFAR, the US President's Emergency Plan for AIDS Relief, has been working here since 2004 and invested $400 million this year alone in Uganda to help fight HIV and AIDS. Along with other international organisations, they now have to review their support here. Mary Borgman is the PEPFAR country coordinator. Our decades of gains and Uganda's reputation as a regional leader in health is threatened. Criminalising same-sex conduct and persecution of LGBTQI plus persons results in higher rates of HIV and AIDS. And these higher rates are not limited to the LGBTQI plus community. It truly impacts our whole society. So the AHA will further postpone the day when or if Uganda reaches HIV epidemic control. Grawnia Harrington reporting from Uganda. You're listening to Health Check from the BBC. I'm Claudia Hammond and my guest today is BBC health reporter Philippa Roxby. Now I wanted to ask you, Philippa, about some new research just published today actually on mosquito nets. Now in the past these have been a real public health success story against malaria, haven't they? They really have. They've been the main tool used to protect people against malaria. They're used in millions of people's homes. They protect them from the mosquitoes and they actually kill them. They either kill the mosquitoes because the nets are covered in insecticides or they stop the mosquitoes from reproducing. And over the years they've been a great tool to have. But there's one problem. Resistance to those nets has built up in the mosquitoes. In other words, they're less effective at doing what they should do than they were before. So the insecticides have stopped working as well basically. Exactly. And so what have they tried out in this new trial which was in Benin and Burkina Faso and Tanzania? That's right. What they've tried is to use a different combination of insecticides on the nets to see if that works better. So not just the original one but a combination of different ones. They've tried different mixtures and they've worked out that they've probably got a better formulation now and they want to spread that widely. So that's good news, isn't it? Really good news. Really positive because let's face it, vaccines against malaria are just starting to be introduced in Africa but bed nets are really the things that have saved most lives. And remember this is a disease that kills half a million children under the age of five. So it's so important that they get this right. And interestingly I saw that today the World Health Organization has announced it is updating its guidelines on the basis of this study. I mean that's quick, isn't it? Imagine to have that impact if you're a scientist. Yeah, if you're a scientist involved in this area that's huge, isn't it? And of course there have been lots of different studies in this area. Not just this one but lots of different other studies as well showing that the combination of different insecticide chemicals is the way to go. And I guess even with a vaccine people are going to be advised still to use nets anyway because a vaccine is never going to be 100%. Exactly. Vaccines aren't usually 100% effective so they need other tools and this is one of the main ones. Thanks for that, Philippa. Now we have something really extraordinary. It's a recreation of a piece of music constructed from the electrical activity happening in the brains of 29 people while they listen to it. Now this is the first time this has ever been done but it is more than just a clever piece of science. In the long term this could lead to new technologies to help people who are struggling to speak after a stroke or another neurological problem. Bob Knight who's professor of psychology and neuroscience at the University of California, Berkeley, told me how this research has been a long time coming. Back in around 2010 we were working to develop a way to decode word representation in the brain and then decode imagined word representation with the goal to develop a speech prosthetic device. In parallel we decided to record music. And so what's been done to the patients? What have you put on their brains? These patients are being evaluated for what's called intractable medication refractory epilepsy. They don't respond to meds and so they come in and the team which is neurologists and neurosurgeons place electrodes on the brain in areas that might be likely to be the seizure onset. If it can be localized that particular area of the brain is surgically removed and you get very good control of the person's previously uncontrolled seizures. While they're in the hospital with these electrodes inserted either on the surface of the brain or in the depth of the brain we then do different experiments. So you played people some music and we're going to hear now one of these if you like the brain recordings we're going to hear how people's brains you know reconstructed a particular song and I'm wondering whether people can guess which song people were listening to. And here's the original clip. So this is Pink Floyd of course. Why did you choose Pink Floyd? I think it's because all the investigators like Pink Floyd. There's another benefit of this Pink Floyd piece is that it does have both harmonics and song in it so we get both vocals and we get harmonics. So it's another brick in the wall and we're going to hear that brain clip again now because I think it's really interesting once you know what it is to hear it. So what are we actually listening to? Is this the brain activity that's taking place while people are listening to the song? The sound comes in, it hits the cortex, we record the electrical activity, we turn it back into sound. Yeah so what the person actually heard was just like everybody might hear, was the perfect version of the recording. Absolutely, yeah that's what they heard. You hear something whether it's a word or a music or just a simple sound and it activates cells in the brain. So basically we directly record the electrical activity and then we use reconstruction methods to match the electrode and its electrical activity to a specific rhythm or tonal or melodic component. I think a way to think about it is if you are a piano player and you know how to play the piano and you watch someone playing the piano with the sound off, you can actually tell what piece they're playing. In a way that's what we're doing, we're treating each electrode in the brain as a piano key that has some information that we're going to decode. So in a sense is this a form of, I don't know, a form of mind reading almost that you've been able to decode what the brain's perceiving? From our perspective as neurologists and neuroscientists we want to be able to mind read because we want to be able to develop prosthetic devices to have assisted technology for people with neurological problems. Now I will say this is just the first step. As with when we did the word reconstruction, the first thing we did is exactly what we just did with Pink Floyd, which was reconstruct the words, but that doesn't help a patient, right? It's a nice finding. You have to really be able to reconstruct when the person imagines a word or imagines music. That would be the next step because then particularly in terms of the prosthetic device, that's what you need to be able to do. You need to be able to do, be able to decode when the patient with ALS wants to say, I'm hungry. I love you. I want to go to the bathroom. How are the kids or whatever. So in the future if this all works, what you'd do is you'd get them to imagine saying, how are the kids? And then somehow that sound would be sort of translated in some form into something written or to a sound. To a sound, yeah, absolutely. I mean the sound part, in fact, that's why we like the music thing that we've been able to work on because the current speech decoders have a somewhat of a robotic output. In other words, it would sound like I love you instead of I love you. And I think music with its prosodic and rhythmic and more emotional structure will be able to add to the semantic reconstruction of the decoders so that you have an output eventually in these prosthetic devices that's more human. And which people are you hoping this kind of research might help in the end? What sort of conditions would they have? The first and most obvious would be people with amyotrophic lateral sclerosis, ALS, if you think about someone like Stephen Hawking with a brilliant mind but he can't communicate, brain stem strokes, people with aphasia, people with severe stuttering, people with nonverbal apraxia from neurodevelopmental disorders. So the number of people who are unfortunately suffering from these things is fairly wide. And I should mention it has been known for over 100 years that if you develop an aphasia, which means you can't, let's say a broca's aphasia, which means you understand what people are saying to you but you can't output speech, at least half of those patients can actually sing correctly, the semantic content. What is going on there? You know, we're pursuing research in that area. We're actually recording intracranially in patients who are speaking or singing to see if we can figure out what is the physiological network that might lead to newer treatment. That would be very interesting to work out exactly what is happening there because as you say, that's such an old finding. It's something that's happened for so long. Yeah, it's amazing when you see a patient, you know, the senior neurologist will say, watch this and then the patient sings happy birthday, and you go, wow. But it's not just over learned things. These patients can actually sing. They don't really know they can do this because it's not been pushed enough, but they can actually sing things they've never heard before. So that tells you that it is a very innate capacity of preserved singing in the presence of absent speech. And how far away do you think these sorts of devices might be? Is this work that's a long way off? Considering the speed of the development of the technology, maybe we have something that's really viable for implantation in five to ten years. I mean, there are pilot studies being done now. In anything you are doing reconstruction on or any kind of AI or machine learning, it's a function of the amount of data you put in and the amount of time you have for the data. So for instance, if you do reconstruction that you heard, it sounds like you're speaking from underwater. But I'm pretty assured that if we had grids that had a millimeter and a half spacing, that would be a much crisper presentation. So that's a technical issue that needs to be broached. Yes, you need to be able to have more electrodes closer together. Exactly. It's really as simple as that. The other thing is that the technology has to become more wireless. Remember, all the stuff that we've done is people in a hospital in an epilepsy monitoring unit with electrodes implanted and wires are coming out. That'll happen. I've been turning this into wireless. I don't want to say it's trivial, but that's easily doable. And I guess what you need is something that can work outside the lab as well, isn't it? It's all very well in one way what you can do in the lab, but you need it to be created in such a way that people can have this at home and try and carry on living their lives. Absolutely. That's the goal. I mean, if you think about it, when people introduced the idea of having a cochlear implant, everybody said it was silly. It never worked. You have 25,000 hair cells in your hearing apparatus and you go to put an electrode in that has 64 contacts, it will not work. Well, guess what? The brain is amazing. It hears first a muddy, again, a rrrrrrr and over the course of weeks or months, the patient figures is able to extract meaningful sound and hear. Similarly, now, deep brain stimulation for movement disorders in Parkinson's is widely applied around the world. There have been many, many people helped by that and that's outpatient, electrode in your head and it's becoming more exciting in a sense. It used to be that the patients had to turn on the stimulator when they were starting to feel slow or stiff and now there's been nice development of closed loop technology where you sense this brain state. Is the brain frozen or beginning to be frozen and the stimulator gets turned on? So these are already being done. So it'll happen in the field of communication. Professor Bob Knight, now, Philippa, before we go, I want to ask you about a study that I noticed you'd written about for the BBC News website because I'm really intrigued by this study and apologies to anyone listening who is eating because this is research about doctors and other medical staff picking their noses. What is this research? I know. I'm sorry to be bringing this up but it does happen and lots of us do it and it turns out that health workers do as well. There's a Dutch study that's been carried out on about 200 health workers and they asked them, do you pick your noses or not? A lot of them said yes, about 90% of doctors. Now this is where this is a bit extraordinary, isn't it? And doctors I know have said, you know, the doctors must have been joking when they filled in this study because they just can't believe that 95% of people, I don't know, would admit to it for a start. I have to confess, I did look up to see whether the Netherlands had its own April Fool's Day and whether this story was really true but it does seem to be, doesn't it? Yeah, it does. I mean, perhaps the doctors were just unfailingly honest about their habits but there you go. They were more likely, the nose pickers were more likely to test positive for COVID. And bear in mind that this is in 2021. So at the height of the pandemic, people were wearing masks in hospitals and of course there was a lot of spread of COVID at that point and they tried to work out whether wearing glasses, having a beard or having a nose picking habit was more likely to make you get COVID. And nose picking came out top. It's interesting, isn't it? Because you think the masks would have been across their noses as well as their mouth. So their noses would have been kind of hard to get to as well. And does it make sense that that would spread COVID? It does. It really does because COVID, particularly Omicron, stays, really lives in the moist tissues of the nose. So anything you're doing up there, I'm sorry to say that again, and anything you can bring out of your nose at that point, there's a risk of spreading it around. Not only that, when your hands, which may have the virus on them, go into your nose, you're putting it right into the bit of the body that's going to take COVID straight in. Yeah. And I suppose that's how you test for it, isn't it? That you're sticking the thing up your nose and getting the moisture out from there in order to test whether you've got it. Exactly. Exactly. And that's what it is. And also on the topic of COVID, I wanted to ask you about this new variant people might have been hearing about called Eris. Named after a Greek goddess, because we know that the WHO likes to name these sub variants using Greek letters, and this time it's a goddess. So it's also called EG5. It's a sub variant of Omicron. So don't worry too much. This is not a completely separate variant. It's now a variant of interest, which means they're watching it closely, but it's not necessarily more severe. There's no evidence it's causing more severe COVID. But cases around the world are going up slightly. I think in more than 50 countries, they've found this particular Eris variant. And so they're keeping a close eye on it, like they do with all these separate variants. Because there have been other variants of interest as well, haven't there? There's quite a few. Yeah, there's been lots and lots of them over time. But this one seems to be just of interest because it's slightly putting its head above the parapet. So we're keeping an eye on it. Yeah, we want them to keep an eye on these things for us, don't we? Yes. Well, thank you very much, Philippa Roxby, for joining us today. And thank you for listening to Health Check. And thanks to the producer, Claire Salisbury, and our studio engineers today, Kath McGee and Jackie Margerum. You can find me on Instagram and Twitter at Claudia Hammond. In the next episode of Health Check from the BBC, we'll be asking whether it's better to eat fast or slowly. Do join me if you can."}, "podcast_summary": "Discover the fascinating world of neuroscience with the latest episode of Health Check from the BBC World Service. Hear how scientists are decoding brain activity to understand speech and create new technologies to assist those with neurological disorders. Plus, find out about the intriguing study on nose-picking habits among health workers and its link to COVID. Tune in now to explore these captivating topics and more.", "podcast_guest": "Philippa Roxby", "podcast_highlights": "Highlights from the podcast transcript:\n\n1. \"They've tried different mixtures and they've worked out that they've probably got a better formulation now and they want to spread that widely.\" (Referring to the research on mosquito bed nets and the development of more effective insecticides.)\n2. \"Considering the speed of the development of the technology, maybe we have something that's really viable for implantation in five to ten years.\" (Regarding the potential for speech prosthetic devices based on brain activity research.)"}