{"podcast_details": {"podcast_title": "Infertile AF", "episode_title": "Author and Motivational Speaker Alexis Jones", "episode_image": "https://media.redcircle.com/images/2021/7/28/21/95ef1312-e607-47b0-ac69-37d46a1e049f_4796d451-1a0b-470a-b769-96fb152be1d9_img_0661.jpg", "episode_transcript": " Hey guys, it's Allie. Welcome back to Inferlift, the podcast. This is episode 235 called Alexis Jones. This podcast is sponsored by Resubtiva DX. Resubtiva DX is a powerful test that has helped thousands of women who have experienced recurrent pregnancy loss or IVF failure. The test helps detect inflammatory conditions of the uterus that might be preventing you from becoming pregnant or staying pregnant. The most common underlying condition of a positive Resubtiva DX test is endometriosis with or without symptoms. If you or someone you know has struggled with IVF, Resubtiva DX may give you the answer and treatment protocols that you're looking for. Talk with your doctor about Resubtiva DX because the journey is so worth it. Plus guys, Inferlift listeners are getting $75 off the Resubtiva DX test. So all you have to do is go to ResubtivaDX.com or download the app Resubtiva DX, use code InfertileAF23 and you'll get $75 off. Thanks Resubtiva DX. This episode is sponsored by Mira. How does Mira help track ovulation? Mira measures actual fertility hormone concentrations with 99% accuracy. Mira is unlike other fertility trackers. It uses technology that's similar to what's used in the fertility lab. So it's just like having your own mini lab at home. With the power of AI, Mira learns about your cycle and gives you personalized and accurate insights about your ovulation and fertility window. And yes, it works for those with irregular cycles and PCOS. Mira syncs your data automatically, eliminating both manual charting and guesswork. Designed to be expandable, the Mira system will also offer more at home health tracking in the future. In addition to LH, E3G, and PDG, Mira now has the capacity to measure your FSH and soon your HCG, plus other hormones. Guys, that's a mouthful. Order the Mira Starter Kit or Mira Plus Starter Kit online at MiraCare.com with promo code InfertileAF to get an exclusive discount. Again, go to MiraCare.com. That's M-I-R-A-C-A-R-E.com. Use code InfertileAF and you'll get an exclusive InfertileAF listener discount. Thanks, Mira. Well, hello there. I'm Lauren. Hey, hey, I'm Lauren's co-host, Michelle. And together, we're the hosts of Cozy Conversations with the Sister Project, our lifestyle and pop culture podcast. We're sisters from the Midwest who have an affinity for the cozy life and newsworthy items we really think you should know about, all ranging in topics from wellness to pop culture. And just as sisters do, we share everything from our Trader Joe's must-haves to all of our favorite skincare. And beyond that, everything we are reading, watching, and listening to, which happens to be my favorite segment of the show. You know, tuning into our podcast is kind of like hanging out with two sisters you never knew you needed or wanted. And can I just say we are two seriously fun sisters. This is true. Cozy Conversations with the Sister Project is streamable anywhere you stream podcasts with a new episode dropping every Thursday. Gosh, we sure hope you tune in. We promise you will not regret it. No, you won't. Stay cozy, you guys. Okay, before we get started, guys, I just wanted to remind you about Fertility Rally. If you're looking for a safe place to land, it's the place I wish I had when I was going through all this shit. It is a community. We have curated events. We have four to five support groups per week virtually. You can come to any or all of them. We have three private Facebook groups. We have a community of 500 plus badass women and some guys too because we have a Rally Guys group, support group, once a month, all over the country. Anyway, everybody is welcome no matter where you're at in your journey. Just wanted to let you guys know that it's available. We are open now. We are actually having a little summer flash sale for $30 off. If you go to our website, which is fertilityrally.com, and you use the code SUMMER, you will get $30 off our annual membership. It's only $169. There's also a monthly option too. Hit me up if you guys have any questions, but I just want you to know it's available for you. Everybody is welcome. Please come check us out. We'd love to have you. All right, and now for today's guest. Alexis Jones, I had the greatest time talking to her. She's a new mom. She's a speaker. She's an activist. She's a New York Times bestselling author. Today she's going to tell us all about her infertility journey. We cover so much, including five frustrated years of unexplained infertility, going through IVF, a heartbreaking miscarriage, going through an egg donor, an embryo transfer, what happened when she finally did get pregnant, and so much more. Alexis has also written this incredible memoir called Joy Hunter that I want you guys to all check out. She's just really cool and had a great time talking to her. Without further ado, this is Alexis's infertility story. All right, Alexis Jones. Hello. How are you? Hi. So good. How are you? Good. Thank you so much for doing this today. So I always start with this question, which is, did you always want to be a mom? I didn't know. That's that. And which actually felt like more stressful. I always envied like women who like always knew they wanted to be a mom. And I equally envied women who like knew with absolute certainty that they didn't want to be a mom. And I feel like the majority of my life, I was like constantly vacillating. I'm like, you know, I think so. I mean, but I don't know. Maybe not. But I love my career. But that would be really meaningful. So I think I was just like constantly teetering on the fence and felt like something was broken in me that I didn't have like a clear answer either way. Yeah, I was similar. I think I felt like it would always kind of be part of my story, but I wasn't like super strongly going towards either way. Yeah, exactly. OK, so tell me fast forwarding a whole bunch. What was when you, you know, growing up, what did you know about fertility and becoming pregnant and how easy or hard it was to become pregnant? Like what was your education in terms of fertility? My education was none. I grew up in Texas. I grew up in the South. I grew up in the Bible Belt. I grew up in the church. So it was basically like the only education I had around sex in general was don't have it. And then my mom had actually gotten pregnant really young when she was 16. So the only messaging I got in my house was wait, wait, wait, wait, wait, not necessarily on sex, but wait on kids like live your life, go like pursue your dreams, do all the traveling. So it was like kind of this massive overcompensation. I think for her getting pregnant so young that she really wanted me to wait until later. So much so that by the time I was almost 35, my mom was like, OK, like I mean, wait, but like maybe start, you know, thinking about it now, like a grand kid. And then honestly, at that point, and I was 34 turning 35 and my husband and I had been married for a couple of years. And I actually hired a doula because I was so shame, like shameful isn't the right word, but like maybe embarrassed that like I had like no concept. Like I knew that we like ovulated, but like and I was peeing on ovulation strips. But like I didn't know how like any of like it actually works. Totally. I actually reached out to a handful of my girlfriends and we were all kind of a similar boat. And and I was like, out of curiosity, like, do you all know a lot about the like getting pregnant, like all that? Anyway, I hired this doula and like no joke, she did like a private like three hour workshop with me and like middle 30 year old women to like tell us things. And like in the first 10 minutes, we were like, oh, she like had workshops and was like, here, identify all the parts of the vagina. And we were like, like, look at each other's sheets being like, how do we not like know? That's so brilliant that you did that. Yeah, I wish that that was more common. I wish I had done that because I was the same as you. I was so clueless and it was always don't get pregnant, don't get pregnant, easy to become pregnant. Yeah. Oh, my God. And then only when you're actually trying to get pregnant, much less if you actually have infertility issues, which I had them in spades. Right. Like only then I'm like, what the hell? Yeah. My whole life I thought I was going to sneeze and get pregnant. You know, and now it's actually like very difficult to get pregnant. So tell me. Oh, my God, I know. Please. So tell me about meeting your husband. And when did you guys know that, you know, you were going to stay together, get married and all that stuff and create a family? Yeah, it's kind of a funny backstory. I was actually friends with his older brother. His older brother and I were in the same grade and my husband was one grade younger. And I would go over to their house all the time when I was in the fourth grade. So I've actually like known the Buckmans forever. His older brother, Ben, my husband's name is Brad. Lot of bees. And Ben was my first kiss. Oh, wow. Grade fourth or fifth grade. And we were playing spin the bottle. Really serious game. And needless to say, I grew up with my husband since obviously elementary school. So we went to elementary school, we went to middle school and we went to high school together. OK. And he was our star basketball player. I joke that I think he was six, nine when we were like 16. And but we never dated growing up. He was super shy. And so he got out like three words to me ever. Like, oh, my God, high school career. Like he would walk up and be like, hey, Lexi, so how are you? OK. He was like, oh, I like fumble and then like walk away. And I was like an older girl in high school, you know, in like one year. I mean, is like you feel like you're in a different stratosphere. Oh, totally. Oh, my God. Why is he talking to me? Why is your boy talking to me? Yeah. Go on the basketball court. Stay in your lane. Yeah. And so we never dated growing up. And then eventually he played basketball at University of Texas and then he played professionally for nine years. And I came home. I did my undergrad and master's at USC. So I went out to L.A. So we didn't see each other for years, for almost a decade. And then I came I came back home to our hometown of Austin and he was off season. So we ran into each other in a local bar and we started chatting up and he was like telling me all these like hilarious stories about us growing up in middle school. And then he asked me out and I was like, yeah, I know that'd be great. And on our first date, like 10 minutes in, he was like, I'm not even going to play it cool. And I was like, OK, you're like, I have a confession. He was like, I've been in love with you since I was 10. Oh, my God. Of course, really, really sweet moment. So I just got the chills. Yeah. Listen, buddy, if that's a line, it just works. You totally. Yeah. So we always joke that it was like game on. I mean, really, we were one like it was for me. It felt so different even in that like first date, like I have huge dimples and I was laughing so hard throughout the first date that like my dimples kept cramping. I kept being like, stop it. Stop it. And it was a simple cramp. Yeah. Dimple cramps. There was something that was so different. It felt so different about him that I was like, oh, I think this guy might be my person. Oh, my God. And he was like, you what? Did you play spin the bottle on that first date? You're like, he's like, I'm going to get revenge on my brother. Exactly. We did a little more than spin the bottle. But yeah, yeah, totally. Yeah. To this day, of course, at our wedding and he actually made out with my very best friend in high school. So we joked that my maid of honor and his best man, his brother, that there was like a big joke at our wedding that they're like, oh, it's not the first buff man. She's kissed. Right. Oh, that's not. There's a whole there's a whole thing about it. Oh, my gosh. That's great. So tell me what happened when you guys started to try to have babies. Yeah, we so we reconnected later in life reconnected when I was like twenty eight, twenty nine. I was married till I was thirty two. So, you know, and it's funny that like when I was younger, I had this like whole vision in my head. I was like, obviously, I'm going to like meet my person. We're going to get married at twenty five. Then, you know, I'm going to want time with them. So then, you know, we won't start babies until twenty eight. And I didn't even meet brother like it married until thirty two. So I felt already behind. I was super head down in my career and my career was like incredibly demanding time wise because I was on the road so much. So at that point, I was on the road, gosh, like two hundred and fifty days a year work wise. Tell everybody what you were doing. Yeah, I was speaking as an author. At that point, I was an author and I was speaking out, traveling all around the world. And I had started two different companies, one called I am that girl. I was kind of a badass version of Girl Scouts for college girls. We had over a million girls involved. And then I started a company called Protector that was working with Division one locker rooms and in board rooms and in war rooms, working with men specifically on the importance of respecting women. And so I was traveling all over the world speaking. And so I knew right when we got married at thirty two, I was like, yo, I need I need I need some more time. And I had the belief system that like obviously the minute I start trying, I'm, you know, I'm going to get pregnant immediately. So we put it off. We're looking at it like not not trying, but definitely not trying. So that lasted for a couple of years. And then thirty four, thirty five. And my mom was like, I think you got the memo too much. Maybe start thinking about kiddos. Right. And that was when for full calendar year, I was actively and I'm very type A. And now we are trying and trying. I mean, like peeing on all the, you know, ovulation strips and doing all the things. And like, obviously, I'm going to get pregnant in a month. And then, of course, for us, twelve months later, still not pregnant. You kind of being like, wait, what? Right. So what was going on mentally with you? Like, I've always been very open about how I was so sad and depressed and it was just such a dark time. What were you feeling? I think at the time, honestly, I think I was actually feeling a little bit of relief because I was really overwhelmed with like how my life was so full. I had no idea how I was going to like add this new layer of like motherhood and child into at the time. Now I can look back and say it was like an incredibly unhealthy, like imbalanced work, work life situation. So I think every month I was like, oh, dang, but kind of relieved and and at the same time, I'm super goal oriented. So there was real disappointment of like, I'm trying to do this thing and this thing isn't working. And I think as an entrepreneur, like the mentality of like building things from nothing gives a false sense of control. And so I was like, well, there's this thing that I'm trying to. It was a very like complicated. And I want to like speak to like the complicated nuances of like emotions that are seemingly opposing that are coexisting. So like on one hand, I'm like kind of relieved because I'm like, how am I possibly going to have a baby and add that to my like 250 day schedule? And at the same time, I'm like, what the hell? Like I'm really good at like making shit happen. And this isn't happening. Right. So it was a combination of like, what? Yeah. It's a pain and relief. I think it's so important to to note that, like you said, so many of us are so used to like if you work hard at something and check all the boxes and do all the shit, it's going to pan out. You're going to get what you want. You know, hard work will get you there. And this is not one of those areas where you can do all the things and it still doesn't work out. And that was so hard for me to wrap my brain around. So I was like, I feel like I'm studying as hard as I can for a final and still getting an F. You know, like, what the actual fuck? Like, how is this a thing? You know, so. Amen. Amen for like saying that. Because I think as women, I always say, like, we're incredibly capable creatures. Right. Like we just like we can handle so much. And especially if you're that type of person who's like proactive and if you have any identity around like a bolsterous work ethic where you're like, no, no, no, I work hard. So like my hard work, there's like all the fruits of my labor and like, look at all the things I've like built and done. And then all of a sudden, like you said, in a certain point, it maybe even became a bit like a bruising my ego. Right. Because I'm like, no, no, no, I'm used to getting like shit done and like in a very effective manner. And then the more that it wasn't working. So after like months and months of trying and like being on ovulation strips. And as you know, it's like everyone's launching like unwarranted, like, have you tried this and have you got sex and then just relax? And yeah, like at one point, my husband was like, one guy said that his wife took like food to Fed. And I'm like, what? Like you just started hearing like the most ridiculous thing. And another person is peddling like ground up unicorn horn. A hundred percent. You're like, yeah, I'll take those pills. I'll do that. Seventeen quail eggs a day. I'm like, I'll do it. I'll do it. Yeah. Yeah. Yeah. Yeah. I would have done anything. I tried all the, all the things. I tried all the ways. I tried all the things. I tried all the woo woo things. All the like, yeah. And isn't it funny if you're like even remotely cerebral where you're like, no, no, no, I use like logic and science. And then before you know it, I was like out feet on the earth, like on in the middle of like a full moon night. Like all in Brad was like, wow, babe, like you're going next level, dude. And that wasn't even the like, I joke that I like unintentionally quit drinking alcohol because at the time I was just like, okay, like I want to alcohol and then I want to caffeine and then no refined sugars. And then I'll only eat air and organic, you know, and you're like, you just, I just went down this rabbit hole exactly of what you're saying. I like this anxiety riddled. Tell me all the things and I'm going to work harder. Yeah. And absolutely. I like that's my personality. Yeah. I went and saw psychic. I had like magic, magic wish papers that I made my whole family light and like make wishes. I like left water out like to make moon water, you know, like all the things God that's so relieving. Yes. Every single thing that you just said, I'm like acupuncture and like in everything woo woo that you can possibly imagine I was doing. So as it sounds like similarly, it was like I got to a place of desperation of like doing anything and everything. And then we finally actually ended up going to a fertility clinic. That was my next question. When did you go seek treatment? Yeah. So it was about not quite a year and mainly because I'm impatient. I'm like, this isn't working. And I think I even said, and speaking of psychics, I mean, this is so random. I wasn't even going to mention this because it sounds crazy, but I was actually in India and there was this like really famous psychic and I went and had a conversation with him. And he said, like, by the way, like you're probably going to go through menopause early and like, if you want to have kids, you need to do that immediately. And like, of course, I'm announcing him, like we've been trying and like things weren't working. So I actually came home, which like I said, I don't talk about that publicly because people are like, really? It doesn't sound crazy to me. But I mean, you start reaching for like anything and everything that'll like give you more information. So I came home from India and I told Brad and I was like, I think I have fertility issues. And he was like, what are you talking about, babe? Like the time I was again, like 34 going into 35, but I was super healthy. I, you know, ate really well, like did all the things. And he was like, what are you talking about? Like we've been trying that long. Like, you know, it's been like, I don't maybe at that point, like three to six months. And I was like, no, like I actually talked to the psychic. He said it was going to be really hard for us to have kids and this and this. And so I actually proactively was like, listen, I'm probably jumping the gun and it is what it is, but like, I'm going to make an appointment because I'm also impatient as fuck. And so I was just like, let's go ahead and like, I'm sure everything's fine and we'll do all the tests and everything will be fine. But I went ahead and made the appointment, which the top fertility doctor in Texas was also one of my best friends growing up dad, which of course we were like Dr. Vaughn at Texas fertility. Oh my God. That's where Blair, that's where my fertility rally co-founder goes to Dr. Vaughn. No way. Yeah, he's amazing. And so his daughter, Megan Vaughn was one of my best friends in high school. And so of course, when we were like 14, we were like, gross, your dad like looks at vaginas for a living. It's such a cringey profession as like a teen girl. It's like your worst nightmare. And then of course I like call her at like 34 years old and I was like, hey bro, who knew that eventually I'd be asking your dad to get up in mine. You know, and she was like, wow, yeah, that's where we're at. So I went and met with him and we did all the tests and sure enough, they came back fit and he even said, cause you know, I grew up with them. So he was, you know, really like personally involved in our situation and he knew my husband because we all grew up together. So he was like, wow, this is actually shocking Alexis for how young you are to be at our clinic, to have such a low egg count and to have like the egg quality be so low. Okay. So that's what the diagnosis was like diminished ovarian reserve and low egg quality. Exactly. Exactly. So he said immediately took off like the first two options, right? Like no turkey baser and we're not doing Clomid or anything like that. Like we're not doing drugs. Like the best option for you right now is IVF, which as you know, is the most expensive option. And I feel like a lot of times like people don't talk about the finances of this. So like that plays like such a real, and it feels like kind of icky, like to talk about people like you're never going to think about the money. Like when you have a baby and you're like, yeah, but I'm thinking about the money now because it's my life, you know, and it's like straight out of our savings. So my husband and I did IDF and we only got two eggs in the entire retrieval. And then one of them, one of them didn't even make it to a blast blast is so we only one egg. And so Dr. Vaughn said because of that, we weren't going to do genetic testing. We weren't going to freeze it and send it off because we didn't want to deal with the percentage of eggs that don't survive that. So we did a fresh embryo transfer. And after years at that point of this journey, we finally got pregnant and we were so excited and weeks passed and you know, everyone is dropping off presents and everyone is saying congratulations and God is so good. And like all of the cliches and then we ended up losing that pregnancy. And I'm so sorry. That was just like one of the like, and in that moment, so when you asked me the question of like, when did you know you wanted to be a mom or did you always know you wanted to be a mom? I think that was the tipping point for me was, and I can only like give context and words to this in hindsight, but I think because like motherhood felt like this very like out of my control experience that it made it. It made me really afraid to want it really badly because I think in the back of my mind, there was always this fear of disappointment. And then there was this layered fear of I knew that my husband always wanted to be a dad. So there was this fear about like, oh my gosh. And especially when we got the diagnosis that like, I quote unquote was the problem, right? That it was like my fault that we weren't getting pregnant. And since then we've had like so much therapy and of course we know, you know, it's not my fault. It's not anybody's fault. There's, you know, people's bodies are not broken. Like this is just, you know, medical diagnosis, medical diagnosis. And at the time I really took on the guilt that this is my fault completely and had the fear of like, I remember telling Brad, like you didn't sign up for this. Like, I get it. If you don't want to be with somebody else, yeah. You know, which was like a terrifying thought, but I think it was after losing, having that miscarriage. Yeah. Can we unpack when I really like realized I wanted to be a mom. Tell me about the loss. If you don't mind. How did you figure it out? And like what was happening? We were doing very standard blood work. Like the weeks after the transfer. And I think at the time it hadn't been communicated to me that there was anything referred to as a chemical pregnancy. Because you're, I was being pumped so full of hormones continually that I didn't know that. And that is like a bit of information that I wish from an expectation standpoint that I'd been given better expectations because at this point we thought like we were in the green. We were like, Oh, that's like healthy embryo. And now it's in my uterus and now I'm pregnant. So like we're through all the obstacles and now this pregnancy is going to be successful because they're high rates of success for transferred embryos. So what do you wish specifically that you had known? I wish I wish I'd even known the concept of what a chemical pregnancy was. I'd never even heard of that. So we were doing all of the very traditional normal blood work that, you know, every week and every week the nurse would call and say it's grown like congratulations. We're, you know, we're still on the path basically. And then we were actually looking at a house. So we were with a real estate agent and our nurse was calling. It was very, you know, like, Oh, one second. Let me step out. Like she's telling us that we're like, everything's great. And I stepped out and it is something I appreciate. Like it talked about like ripping off the bandaid. She called and she said, Alexis, I'm so sorry. Your pregnancy is no longer viable. And I just had like, and it's so interesting because looking back, like I didn't even, I don't even think I responded to her. I think I just hung up the phone and obviously it's real estate agent. My husband are inside of the house. And I would say that like, I think that Brad felt the atomic blast inside of me because he looked at me through the window and we didn't exchange a single word. And I walked out the back fence because I didn't even like want to walk back through the house. And like, cause we were looking at this house. We were like, Oh my God, we're our family's growing. Like we need a bigger house. And like, and I walked to the car and Brad immediately like wrapped up in it. Like he just knew like, and again, it's interesting how like in partnership and Brad's my best friend in the entire world, how he could just sense the loss. And so he clearly wrapped up the meeting, met me in the car and we did not say a single word as we drove home. And then when we got back home, it was all the things it was. I mean, the screaming, the crying, the like, not the mixed with mascara mixed with like flinging fists. Missed, like, I mean, my whole, it, that was a real. Yeah. I mean, the best way I can describe it is it felt like an apocalypse inside of me. Yeah. And I think that in losing like this dream, like this dream that was now like foreign, like quite literally forming inside of me. And I'd finally let myself be really excited about being a mom and about like two weeks before that. I'd like kind of confess to Brad. I mean, like thank him for all this time. And like, I kept saying like, yeah, but you're the one who wants the baby. Like, I'm doing this for you. Like I said, and I think the truth is like, I've actually never wanted anything so much in my whole life. My God, 100%. I can sell. So like, yeah, that was like, when it really dawned on me and like, I like talk about this in my book, but like, I have these little unicorn slippers next to my, um, next to all my night stand. That my mom had given me. I would like wake up and touch them. It was like this little token of just like, oh my gosh, this is happening, you know? And after our miscarriage, I remember one morning I woke up and it's almost like I woke up and I forgot that I forgot our loss, just because I was like in the middle of that like hazy, just waking up and I went to touch the unicorn slippers because I'd gotten in such a habit. And I just remember like the cold hard truth of it all rushing back to me. And I think it's like for anyone who's ever lost anything, right? Like lost a dream, lost a significant person that they loved, lost a pregnancy. Like I think it's that like human loss of like longing for something that is no longer. And I just remember like grabbing the unicorn slippers. I'm like throwing them across the room. And I was in that really dark place. And I think a lot of times we like glide over these heartbreaks and these face plants. We don't really pay them appropriate homage. And I think especially for people who are in the midst of that, that it's like dangerous to glaze over anything. And so I always say like, I was in that place for months where like getting out of bed was hard. Like if I like getting out of bed felt like a success that day. Yeah. And sometimes even intensely. That's what we talk about in our fertility rally groups too. Sometimes it's like you got out of bed today. You're, you know, let's celebrate the wind, that wind, because sometimes the, you are in that place where doing anything beyond that is just too daunting and heartbreaking. And you know, there's, you mentioned, you know, the loss of a dream. It's like, that's why I always advocate and say that like the loss of a chemical pregnancy or a later miscarriage, or, you know, like it doesn't matter what point, even if it's an embryo that didn't thaw or you didn't get any healthy embryos, like those are all losses. So I want to acknowledge that for everybody that like, it is the loss of a dream. It's a loss of how you thought your life was going to go. And you know, that's sometimes I feel like people are like, Oh, at least it was early. And it's like, fuck that. Yeah. Heartbroken. I'm on the floor right now. Yeah. Yeah. Absolutely. Yeah. And I think also it was, it was a combination of like, now we're back at ground zero. Like there's this interesting thing about fertility where you're like, it reminds me of candy land when it's like, go back to start. I've made it so far, like down this rabbit hole. Now go back to start. Now go back. And it just, it felt like it was constant, like roadblock detour, roadblock detour, you know, and it was like, how many roadblock detours heartbreak can we have? And thank God, Dr. Vaughn. And I love the integrity that he had as a medical professional that we went back to him and we were like, should we do another round of IVF? And he was like, I actually would not professionally recommend that because I think not only are you going to get the same results, I mean, it's not even about the money necessarily, as much as like the emotional toll that that's going to take on you. He was like, so my next suggestion would be getting an egg donor. Okay. Which to your point, like that's another inflection point of grieving, right? Of being like, oh wait, like, and it goes back to those assumptions and expectations of like, I always assumed that I, like my child was going to have the dimples that my mom has that she gave to me. You know what I mean? Like I always thought I was going to be able to participate biologically. And now you're telling me I got to go online and like find a baby mama for my husband to reproduce with. Like that's a hard thing to wrap your head around. Yeah. This episode is sponsored by True Earth Laundry Detergent EcoStrips. True Earth's mission is to help reduce the billions of plastic household containers that end up in our landfills and oceans every year. They currently have household products to make your chores easier in the laundry room, the kitchen, and the bathroom. So a few weeks ago, guys, I got True Earth Laundry Detergent EcoStrips in the mail and I got the fresh linen scented and the fragrance free. And on my next two loads of laundry, I used one of each kind. Okay. So I'm not exaggerating when I say that I am obsessed. These True Earth strips are smaller than the size of your hand. And all you do is take one out of the package, toss it in the machine with your clothes, and it makes everything come out fresh and clean and soft. They're so easy to use. And I honestly don't think I'll ever turn back to like a big jug laundry detergent again. Let's talk about the packaging. It comes in a super compact recyclable paper envelope, and each one contains enough for 35 loads. To see the True Earth package sitting next to my giant plastic jug made me never, ever want to use anything but True Earth again. Think of the impact it has on the environment and if people weren't using all of that plastic. I know that so many of you are into clean and toxin-free household products. So please know that True Earth is paraben-free, phosphate-free, free of added dyes, free of chlorine bleach, vegan, no animal testing, hypoallergenic, and readily biodegradable. It's also really travel-friendly. I could go on and on. So here's the best part. You can try True Earth today at true.earth slash infertileaf and use code infertileaf to get 12% off your order. Again, that's tru.earth slash infertileaf and use code infertileaf to get 12% off today. Thanks, True Earth. Grieving the loss of your genetics is also a really, really big loss. And some people, it takes a while to get there. Some people decide they don't want to go down that road. So tell me about the conversations. I'm sure there were tough conversations that you and Brad had about going down that road. Can you recall some of the things you guys went through? I think that I was always open to all options. So for me, I was like, okay, at that point, that was my moment of certainty of knowing I wanted to be a mom. So I definitely had that in my back pocket. And I think having a really profound why of knowing that I wanted this thing. And then I opened up, I was like the menu of like, do we adopt? Do we foster? Do we do an egg donor? I was open to everything. And at the time, my husband was like, okay, let's try egg donors. But to your point, it is really interesting in partnership, how you're like, you're not always on the same page. And some people feel stronger about something else than other people. And so it was during COVID. And so I would joke with all my single girlfriends, because I have a wicked sense in inappropriate sense of humor. And I just like, I find like, dark humor is like necessary for me in these moments, when things are really hard. And so for me, it was one of those times where I basically, you know, all my girlfriends are like, oh my God, it's so hard to like date during COVID, like to date online. And I'd be like, you know, what's harder is finding, you know, a baby mama for your husband to reproduce with, to be the biological mother of your child. Oh, man. So yeah, we started down that process. But I felt like infertility in itself felt like an isolating experience. And I definitely knew, thank goodness, enough girlfriends who had struggled with fertility issues. So I could relate to them, and I could lean on them. And then when we went to the echelon of like, oh, wow, now you have to do IVF. And this is an entirely new language, right? Like all the shots and like gonna left and like, you learn all these things. All the acronyms, all the acronyms for everything in the schedule, in the timeline, and like all of these things. And I knew maybe a handful of people who at the time had had that experience. But then when we moved to like the next layer of like, egg donorship, we didn't know a single person who had had to go down that route. And again, it's like, as I mentioned, like, I always talk about the finances, because I do think it's taboo. And I always recognize like the asterisk of like, there's already privilege in talking about IVF, and talking about egg donorship, you know, for a lot of friends, like that wasn't even that wasn't on their menu, that didn't unfold as an option for them. And so for us, our journey continued, right, there wasn't a hard roadblock of just like, well, that's not on the table as an option. So when we started looking at egg donorship, all of a sudden, I'm like, in these like online portals, like, reading essays from young women, and having, like you said, these conversations, I never thought I'd have with my husband around like, what are the important things that we are prioritizing in a biological mom. And even that, like my husband, like to this day can't refer to our egg donor, the biological mom, for whatever reason, that is very triggering for him. He is like, No, I don't like it. When you say that, you are his mom. And I'm like, dude, I am his mom. But like, it's just an actual fact, like, that there's another woman that is his biological mother. And so it's like, there's some really tender pieces that like, you start like peeling back that onion. And I ended up finding a young woman in with the agency. And even that I was like, where do you be like, Googled, like, egg donor, like, how do you find, you know, a young woman who's willing to, you know, like, sell her eggs to you. That felt so foreign. Yeah. And did you go through a donor to find, or I'm sorry, did you go through an agency to find your donor? Yeah. So we ended up going through an agency. And the agency actually called us and they're like, we just want to confirm because our top three choices were three entirely different races. And that was an interesting conversation to have, you know, like, are we open to other races? And we had selected an African American woman, we had selected a Latina woman, and we had selected a Pan Asian woman. And I am a Caucasian and Mexican. So I'm half Latina. So for me, it felt important to bring in another ethnicity or another race. And so for even that was a really delicate conversation of like, how, how do we make this? And even for the agency, they're like, you're the first client we've ever had who chose three entirely different like that you were open to that, you know, so we ended up selecting a Latina woman, originally from Argentina. And she was flown to LA. And then my husband was flown to LA. So they did like a fresh transfer, although they'd never met. And then we got five embryos on the other side of genetic testing. We initially got, and this is where you start doing the math and you're like, how does anyone ever get pregnant ever? Totally. 19 eggs from her. Only 11 of them ended up being mature. Then combined with my husband's sperm, we got five embryos. When sent off for genetic testing, we only got two embryos that were considered like viable and healthy. So all of that, and by the way, each one of these things, like from IDF from the beginning to the end, again, not like go back to start the timeline, like, and I think of it in business, why like a sales cycle, you know what I mean? It was like that took, you know, four and a half, five months for IDF. And then an egg donor that took over nine months from the time that we like first made the decision to do it, to finding her, to doing all the legal like contractual work, which like that takes, you know, two months, you know, and then, you know, starting all the basically IDF for her. And then the egg retrieval, like all these things I've just like, I never could have imagined what like long timelines each of these things had. Exactly. So then we only had two embryos, which like truthfully again, really disappointed. Like we always thought we were going to have a bigger family. And now we're told we only have two embryos. And of course we're not guaranteed that any of those embryos take. And I was having a lot of complications with the hormones that they were giving me every time they tried to prep my body for the transfer. Right. What was going on? I was getting sick. So I was having like a very inflamed reaction to all the hormones. So we would like try and prep my body and then I would get cysts and then they'd be like, we can't do the transfer. And then it was like a pause, you know, and we'll wait another month and let the cyst go away. And there was this big irony of like, we have to put you on birth control to make the cyst go away, but then we need to, you know, give you more hormones to like prep your body and to convince your body that like, right. Like it was just the whole thing just felt incredibly complicated. And eventually our doctor, and we, at that point, we're working with a clinic in LA and he actually suggested getting a surrogate. So that was another moment of, okay, for us, where I was like, oh my gosh, like my eggs aren't working. We'd hire another woman to use her eggs. Now you're telling me I can't even carry. And so then we courted for again, another like nine, 10 months, we're working with a surrogate, trying to get all the paperwork and the legal done and like all of the things. And then that actually fell through and that was like nine to 10 months. So like each one of these things, and then it literally felt like, go back to start, go back to start, go back to start. And fortunately, we actually ended up getting a second opinion from another doctor in Houston, who said that he actually thought that I could carry and feel so grateful for that. And I ran a bunch of tests and they actually said, we do think you can carry, we're going to put you on a different medication that we think your body will potentially respond to better. And at that point, I mean, we're talking like now it had been years, you know, now this, I was going to say how many years had it been since you guys started to try at this point. So at that point I was 39. And so it had been four, almost five years of this like ongoing journey. And of course, like, let's also speak to like left and right, my best friends are getting pregnant. Three, four year olds. And I remember one of our very best friends were actually the parents of their goddaughter. And I remember we went out to dinner with them and we were always like, Oh, we'll have like, we always would have the same chart name. We'd always have the same kind of drink. And we went out to dinner and they just started trying to get pregnant. And I was like, Oh, we'll both have the, you know, whatever. And she like looks at me and she was like, actually, like, I, I'm not going to have one. And I like turn and I look at her and I just remember her and I just remember her like grabbing my hand and it like makes me emotional talking about it. Yes. And she was like, I'm so sorry. She was like, I'm pregnant. And I just looked at her and I started welling up with tears. And I was like, why would you ever apologize for that? Like, I'm so happy for you. Like, yes, I know how bad you want to be a mom. Like what a beautiful, what a beautiful thing. And then I was like one second and I literally got up and I like excused myself from the table and I walked into the bathroom and I started bawling. Of course, of course, like both things are true. I was so happy for her and I was so sad for us. Yeah. I was so sad that like she had started trying and like two months into trying, she was pregnant. Here I was like four years deep and he knew intimately how hard this was and how heartbreaking and was like there through the miscarriage and like all the things. Yes. And I came out, I like white, you know, like wipe my tears away. I came out, I sat down and I just said both things get to be true. Absolutely. Oh my God. I feel like we have like a psychic connection because you keep saying things like I'm about to say something and then you say it. So weird. But that's what I was going to say was that those conflicting emotions, like growing up, I feel like we're always taught you, are you happy? Are you sad? Are you this? Are you one thing? Are you this? But like as you get older and maybe always, but it just is never acknowledged, there's so many conflicting, you know, contrary contradictory feelings that can exist at the same time. So be so sad for yourself and happy for your friend at the same time is a real thing, but it's real hard to wrap your brain around. Oh gosh. If you're not used to thinking that that's normal because you're like, am I crazy? Am I, am I a fucking bitch that I'm like sad? You know, like it's so, so I just want to acknowledge again that these are all normal things to feel happy or sad or disappointed for yourself, but like, or not happy for your friend. And that's okay too. You know? Yeah, absolutely. I mean, there is a real feeling of like that isn't fair. And I think that is a very like natural human emotion. And even at the time, like my little sister got pregnant before me and I was like, that's okay. That's okay. Like, you know, good for her. And then she like popped out her second and we were still trying. And I was like, wow, and I was like, wow, okay. I mean, that's cool. And then when I thought I found out she was like pregnant with her third and we hadn't gotten pregnant. I was like, I mean, can you get it to me? Like you already have two, you know what I mean? You have three toys and I have no toys. Can I just have one of your toys? And it's like that emotion is so human to be like, what the fuck? Why is this working for everyone else? And like, this is so hard for me and so hard for, you know, my husband and I. And so I'm always like exactly what you said. I'm like for anyone listening, like whatever your feelings are, they are so like righteous and valid and it is okay to feel all the feelings. And there were moments where like, I could totally like soldier up and go to baby showers and there were sometimes even close friends. And by the way, your close friends will absolutely love you and understand, but every now and again, there's a baby shower. Like I just couldn't, I just like, I just, I just couldn't. And at the time I was like, I'm just sad and I don't want to show up at someone's celebration, you know? And I think that's okay too is to like know your limits and know when you need to like lovingly pass on things and just say, you know what? I got to take care of myself right now. And like what self love looks like is like sending you a beautiful gift. I'm like sending you love from afar. Like that is the best I have to offer you right now. Like I said, my closest friends were always like, oh my God, a hundred percent. And I think because of my sensitivity, because I'm going through it, I have so much sensitivity to it. So I know friends who are like longing to be in a relationship that aren't in a relationship right now, longing to be parents. And even when it came to like our baby shower, like there's one or two girls that I called and I was like, listen, I don't question whether or not you love me. I also know that this is something that you really want and it's not happening for you right now. So I want you to take the best care of you. And if you want to come, I would be overjoyed to have you. And if that doesn't make sense for you, for any reason, like I love you so much and like, let's catch up over cupcakes two days later. Like let's go grab lunch and let's go, you know, whatever. But like I don't, I don't want women putting on a brave face and like inside like cringing and crying. Like I want women taking care of themselves. Totally. And knowing, you know, what their emotional limits are. Um, but yeah, I have a lot of sensitivity to all of this because it feels like on my journey to parenthood that, you know, it's just, uh, I've had a little taste of all of it. I absolutely, the empathy I feel like at least in myself has grown exponentially too. Like it's, yeah, you just, you never know what someone's going through too, you know? Yeah. So what happened next for you guys? Tell me where, what were you guys were? Yeah. So with our second opinion, um, and the doctor said that we could carry, um, we actually, at that point I told Brad, I was like, we're not telling anybody. We were living in Montana at the time. And we like stealthily flew out of Montana, flew to Houston, did the embryo transfer. And I like half jokingly told my husband, I was like, don't make eye contact with me for 10 days, like 10 days to find out if it, if we're crying. Cause I didn't want him to do the like, face like, what if this works? And I was like, I actually can't handle like your disappointment, anyone's disappointment. And I was very much like, it's probably not even going to work. So it doesn't matter. Like, and that was of course me just protecting myself that I was like, it's probably not going to work. It doesn't even matter. I'm just going to pretend like I'm going to black it out. And you know, so of course, 10 days later, not of course, but 10 days later, we got a phone call that I was pregnant. And again, like I'd been there before and it felt like a video game, like, no, no, no, I've made it to this level. And then I died. So like, until I get through like 15 more levels, I'm not going to get excited. And I'm not going to like allow myself to be hopeful because I think sometimes we underestimate how dangerous hope can feel because hope can is like directly tethered to disappointment, potential disappointment. And so I had been sitting in like the waiting room of hope for so many years that I like, it simply felt too dangerous to hold it too close. So that's why I was like, we're not telling anyone like, and so we didn't tell people for months. I mean, we didn't post anything on social media. My God. And so I think I was like eight months pregnant because I was like, Nope, we're not going to jinx it. And you know, eventually we told friends and family and they're like, wait, what? Because we also like failed to communicate that we'd even gotten a second opinion. So we were like, by the way, we're pregnant. They're like, wait, you like the surrogate, like, wait, take us back. Like I thought we had to get another surrogate when the surrogate fell through. And I was like, no, we actually got a second opinion. Like at my, my physical body is housing this baby. And they were like, what? So that was a big exciting moment. And I will say, you know, up until like eight months, I had a really, um, as, uh, uneventful a pregnancy as anyone could possibly want, which is like what you want, right? Like you don't want any big escapades. Um, and so I had a very, as easy a pregnancy as I could have. And I honestly, I kept like joking with Brad that I was like, clearly God has a woman because she was like, this has been so hard. Let's just give them an easy pregnancy. And, um, and looking back, I think I felt like I deserved an easy pregnancy because I was like, I spent five years getting here and this journey has been so hard and so heartbreaking. Right. And, um, so almost, yeah, at about eight months, um, my husband is leading to go on a golf trip. He's headed the Cabo to do his last big hurrah. The next weekend, my best girlfriends were all flying out and we were doing a big hurrah in Bozeman, Montana, where we lived. Um, and I remember like right before he left, he was like, are you sure? Like, you sure I should? And I was like, babe, are you kidding? We're like two months out. We're like, you know, seven weeks out at that point. I was like, you're fine. Everything's going to be fine. And then he's on a plane and I'm like, wait, what's that? What's going on? And I text him and I'm like, I'm sure it's nothing. I'm just going to go to the hospital and like, just double check. I'm sure I'm being like an overly cautious mom. I'm sure everything's fine. Don't worry about it, but just letting you know. Um, and then I go into the hospital and I'm like, uh, I don't know. It kind of feels like I'm like, pain in my pants, but I'm not paying my pants. So what's, what is this? And like within five minutes or like your water's broke. Oh my God. Terrifying. So what did you think? And I was like, wait, no, no, no. What do you say? Like, my mom's not here, which like my mom was going to fly out for like two months and like help us with the baby. And she's my best friend in the whole world. And I was like, no, no, no, no, no, no, no, my mom's, my mom's not here. And my husband's on a plane, like 10,000 feet in the air headed to Cabo. Oh, what are you talking about? Not to mention like seven weeks early, like is my son okay? Like what does that mean? And, um, they were like, yeah, your amniotic sack is broken, which is very rare. And, you know, we're going to give you a shot, a steroid shot right now to help with the development of his lungs. We basically need you to like cross your legs, do not have him for a minimum of 24 hours because we have to give you this other steroid shot, which will significantly like the statistics are crazy with, um, premature labor, this particular steroid shot that needs to be delivered 24 hours apart. And I immediately text Brad and I said, um, call me as soon as you land. Oh God. And so he lands and he's like, Hey babe, is everything okay? And I was like, no, my water broke. And he's like, what? Oh my gosh. No, my husband, he's like a six, nine, like former professional basketball player, like poster boy feminism and like the biggest softy and the title. So he just starts bawling on the phone and it's like, Oh my God, I'm so sorry. I feel so far away. Like I'm getting on like the first light back. Like, you know, and all he's thinking is like, am I going to miss, you know, the delivery of my son? And needless to say, I, when you're amniotic, I didn't know any of this, right? So when you're aiming out at sack first ruptures, um, a lot of times all the hormones will trigger your body into labor. Although sometimes if your body doesn't get the memo, you can basically be on bed rest. So within 24 hours, my body 72 hours, actually, my body did not get the memo. Um, of course this is how naive I was. I was like, okay, cool, cool, cool. I'd like shown up to the hospital in like muck boots and a baseball cap, cause it was Montana. So it was a winter and I'd like left my French bulldog and I was like, Hey girl, like I'll be back in an hour. I'm sure it's nothing. I'm nothing. I don't have a toothbrush. I have like my course in my phone. That's it. And so when they were like, no, you're in me out of sack is first. Like you, we're going to have to admit you. And I was like, okay, okay. I'm like trying to process this, that like, I'm utterly terrified. My mom's not there. My husband's not there. I'm alone in the hospital. All I'm thinking is like, I'm going to deliver this baby by myself. And, uh, and I was like, okay, so I just need to go home real quick. Um, cause I got to get my toothbrush. I got to get like, we didn't even have an overnight bag. We had nothing prepared. And, uh, and I was like, and my dog, like, I have to like figure out and they're like, oh no, sweetheart. Like you're not, you're not going anywhere. Like we're admitting you now. And I was like, what? And I was like, for how long? And they were like, until you deliver. And that's when I was just like, what is happening? And it felt like the fertility journey was continuing to be hard. Exactly. And I was like, can a girl get a break? No. And, um, so I ended up living in the hospital for two and a half weeks and, uh, they eventually induced me because there was a constant threat of, um, infection of course. And then I labored for 30 hours unmedicated until the doctor finally called it. And we did an emergency C-section. Bridger came into this world and they told me that, um, if he was okay, we wouldn't know like how his lungs were. Um, but if you were okay, that we'd get to do skin on skin. And if he wasn't okay, of course they would whisk him away. He was born and like the OR was like, I think 15 people were in the OR it was the NICU specialist. It was the respiratory specialist. Cause we knew because he was at that point born five weeks early that he would have lung development issues. Um, of course the anesthesiologist and the surgeons. And so it was like a packed house. It was like a party. And so they pull him out and, and at this point, I also know every doctor and nurse on staff because I've been living in the hospital for weeks. Exactly. And they're like this poor girl, right? Like she's been like, this has been a real doozy. Right, right, right. So they pull Bridger out and they say, do you want to see your son? And we look at him and then immediately they whisk him away. So we know that he's not okay. And I just hear my like six, nine husband, who's like, you know, a foot and a half taller than all the doctors. And I just hear him saying like, Hey buddy, it's me. I'm your dad. So good. Like keep going, bud. Like your mom's right here. And I'm just like every, all like all the doctors, all the nurses, everyone is just bawling. Yeah. Everyone, everyone is now invested in this dream of ours. Of course. And, um, so yes, a very dramatic emergency C-section. He actually has to get intubated. He had a hole in his lung and thank God. Yeah. Dr. Rock was like on, um, staff that day and like absolutely like supported and saved his life. And they intubated him. They gave him the equivalent of like fix a flat for lungs, for baby lungs. And then he was in the NICU for two and a half weeks. And then he came home on oxygen for two and a half weeks. And if I girl, if I showed you that baby right now, you would not believe, you would not believe the grand entrance he had into this world. But now he's five and a half months and he's like big and chubby and beautiful and chunky as my son would say, he's so chunky. And the reason I share all of that is like my fertility journey didn't get easier. It got a lot harder. Right. I've talked to so many people who are like, like you said, like after going through so much to even get pregnant and have a healthy pregnancy, then the delivery should at least be okay. But, you know, right. Yeah. Yeah. That's exactly how I felt. And that's why I felt a sense of like entitlement. I was like, no, no, no. I spent five years getting into the starting line. Like, can't any of this be easy. And then, um, early water breaking emergency C-section and NICU life. And so that's why I say like, and you were talking about empathy and like looking back, I have the depths of my empathy now for the entire experience in journey, not only to becoming a parent, but like ushering a human into the world in whatever form that is, you know, whether that is, you know, biological, whether that is adoption, whether that is fostering, whether that is surrogacy, whether that is egg ownership, like there's so many ways and so many circuitous routes to becoming a parent. And all of it is so sacred and beautiful. And what I tell everyone is like, for my story is like everything that could possibly go wrong went wrong. And yet all of it was worth it because like I woke up this morning and like, you know, walk upstairs and peer into the crib and like this perfect little human is like this gummy drooly smiling, looking at me and I'm utterly sleep deprived, which is wonderful. Wonderfully unoriginal. I want an original problem. Like I now have original parenting problems, but I look at that little baby and I'm like, bro, all of it was worth it. That's like the, like that's my testimony is like every single thing at every single moment in which I wanted to give up and every ounce of heartbreak and every bit of like very real physical pain that I went through and uncertainty and the unknowable and the fears and the doubts and insecurity and the loss and all of it. My testimony is like, it's worth it. He has been worth it. So tell me about Joy Hunter. That's your latest book, right? Yeah, yeah, exactly. Joy Hunter was golly on the other side of everything that could possibly go wrong all at the same time. My speaking career hit a roadblock, I guess, brick wall rather in 2020. So all my speaking engagements got canceled because of COVID and then we had our miscarriage and then I actually, and like the real story that I talk about in Joy Hunter is I found out my dad was not my biological father on ancestry.com, which was quite the unearthing, quite the family secret. And so I found that out before we would go through all of our fertility issues. And at a certain point, and I talk about this in the book, but at a certain point, and I don't want to give the big reveal away about what the real secret was, which wasn't even about my biological father, but one of the big takeaways is that parenthood is not about biology. And parenthood is actually about a relentless commitment and a relentless love and a relentless showing up rain or shine every day, choosing to love a little human. And so having that experience and being the recipient of that kind of love, that kind of radical love, I think that it gave me a different sense of confidence and knowing that even though I'm not the biological mother of my son, it actually doesn't fucking matter. I'm the one that wakes up every single night and feeds him and loves him and cuddles him and changes his diapers. And especially this morning when I really didn't feel like it, and she's screaming, I'm like, oh my God, I don't know if I can get my body up one more time. And it's like, those are the things that create us as parents that make us parents is like the privilege of like being a slave to the love that we have for our children. And so Joy Hunter was on the other side of our miscarriage on the other side of the biological father reveal of my career and my income hitting a brick wall. It felt like everything that could go wrong went wrong all at the same time. So my husband and I hop in an RV early COVID with our other best friend who he was going through divorce. So he was heartbroken for other reasons. So he was the third wheel hops in the RV with us, we go on this epic adventure all across the country, which is what I talked about with Joy Hunter. And the big theme is that there's always purpose to our pain. And that time is the only revealer of that. And that even in the midst of our darkest moments of like the hardest times, our greatest heartbreak, that no matter what like flickers and glimmers of joy exists every single day, if we train ourselves to find them. And that is what got me through, you know, the having to get an egg donor, like our continued fertility journey. And then I in the book, and when I finished when I submitted my final manuscript, we still had no idea how we were going to get pregnant. Like our journey was still very much like up in the air, and there would be another year plus of heartbreak and disappointment. And so it's really interesting that like I wrote, I wrote this entire book on like, how can you find joy in the midst of like the face plants and, you know, in the midst of the storms, like before the sun comes out in the rainbow, you know, arrives, like, how can we find little little bits of joy. And then, you know, then I had to really, I couldn't just talk about it, I had to live that philosophy through the uncertainty of my water breaking for those next seven weeks. And those seven weeks plus, you know, NICU life and plus my son coming home on oxygen and all the cords and monitors and having to navigate that. And so it was like, nothing prepared me more for parenthood than having to figure out how to find the perfect moments that exist, even in the hardship of parenthood, you know, the sleep deprivation, all things, how can I find one perfect moment every day. So that was the entire philosophy of Joy Hunter. Okay, friends and loved ones, thank you so much for listening. You guys are the best. Thanks to Alexis for sharing her story. Definitely check out Fertility Rally. We are here for you no matter what you're going through. We seriously have members who are going through everything you can imagine. People who are really new to this world, people who've been here for a minute, people who have gotten pregnant and are still in the group because we have a pregnancy after infertility group, people who are moms because we also have a motherhood after infertility group, and people who are on their, you know, multiple rounds of IVF trying for another IVF baby. It's single parents by choice, same sex couples, you name it, and Rally Guys too, which is our once a month free support group. So check us out. We are here for you. You can check us out on Instagram at Fertility Rally or online at FertilityRally.com. And as always, you can check me out on Infertilife Stories on Instagram if you guys have any questions. DM me. My DMs are open. I hope you're having a good day and I'll talk to you soon."}, "podcast_summary": "Don't give up hope on your fertility journey. Join Allie in episode 235 of Inferlift as she shares her struggles and the unexpected twists and turns she encountered on her path to becoming a mother. It's an inspiring story filled with resilience and the power of finding joy in the midst of hardship. Listen now to discover how Allie overcame obstacles to build her family.", "podcast_guest": "Alexis Jones", "podcast_highlights": "Wow, that's quite a journey. Have you considered sharing your story to inspire and support others going through similar experiences? You have a unique perspective and your story could bring hope to others who may be struggling with fertility issues."}